#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.ecs-assume-role-role: Reading...
data.aws_iam_policy_document.ecs-assume-role-role: Read complete after 0s [id=258469924]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_cluster.cc-cluster will be created
  + resource "aws_ecs_cluster" "cc-cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "community-challenge-cluster"
      + tags_all = (known after apply)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.cc-service will be created
  + resource "aws_ecs_service" "cc-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "community-challenge-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "nginx-frontend"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "community-challenge-family"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # aws_iam_policy.ecs-policy will be created
  + resource "aws_iam_policy" "ecs-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AttachNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:CreateNetworkInterfacePermission",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DeleteNetworkInterfacePermission",
                          + "ec2:Describe*",
                          + "ec2:DetachNetworkInterface",
                          + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          + "elasticloadbalancing:DeregisterTargets",
                          + "elasticloadbalancing:Describe*",
                          + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          + "elasticloadbalancing:RegisterTargets",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:CreateHealthCheck",
                          + "route53:DeleteHealthCheck",
                          + "route53:Get*",
                          + "route53:List*",
                          + "route53:UpdateHealthCheck",
                          + "servicediscovery:DeregisterInstance",
                          + "servicediscovery:Get*",
                          + "servicediscovery:List*",
                          + "servicediscovery:RegisterInstance",
                          + "servicediscovery:UpdateInstanceCustomHealthStatus",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECSTaskManagement"
                    },
                  + {
                      + Action   = [
                          + "autoscaling:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AutoScaling"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:DeletePolicy",
                          + "autoscaling:PutScalingPolicy",
                          + "autoscaling:SetInstanceProtection",
                          + "autoscaling:UpdateAutoScalingGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "autoscaling:ResourceTag/AmazonECSManaged" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AutoScalingManagement"
                    },
                  + {
                      + Action   = [
                          + "autoscaling-plans:CreateScalingPlan",
                          + "autoscaling-plans:DeleteScalingPlan",
                          + "autoscaling-plans:DescribeScalingPlans",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AutoScalingPlanManagement"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:DeleteAlarms",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:PutMetricAlarm",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudwatch:*:*:alarm:*"
                      + Sid      = "CWAlarmManagement"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:network-interface/*"
                      + Sid      = "ECSTagging"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:DescribeLogGroups",
                          + "logs:PutRetentionPolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/ecs/*"
                      + Sid      = "CWLogGroupManagement"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/ecs/*:log-stream:*"
                      + Sid      = "CWLogStreamManagement"
                    },
                  + {
                      + Action   = [
                          + "ssm:DescribeSessions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ExecuteCommandSessionManagement"
                    },
                  + {
                      + Action   = [
                          + "ssm:StartSession",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecs:*:*:task/*",
                          + "arn:aws:ssm:*:*:document/AmazonECS-ExecuteInteractiveCommand",
                        ]
                      + Sid      = "ExecuteCommand"
                    },
                  + {
                      + Action    = [
                          + "servicediscovery:CreateHttpNamespace",
                          + "servicediscovery:CreateService",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:TagKeys" = [
                                  + "AmazonECSManaged",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudMapResourceCreation"
                    },
                  + {
                      + Action    = "servicediscovery:TagResource"
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/AmazonECSManaged" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudMapResourceTagging"
                    },
                  + {
                      + Action    = [
                          + "servicediscovery:DeleteService",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/AmazonECSManaged" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudMapResourceDeletion"
                    },
                  + {
                      + Action   = [
                          + "servicediscovery:DiscoverInstances",
                          + "servicediscovery:DiscoverInstancesRevision",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudMapResourceDiscovery"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.ecs_role will be created
  + resource "aws_iam_role" "ecs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "community-challenge-ecs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "project" = "community-challenge"
        }
      + tags_all              = {
          + "project" = "community-challenge"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "community-challenge-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "project" = "community-challenge"
        }
      + tags_all              = {
          + "project" = "community-challenge"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.task_policy will be created
  + resource "aws_iam_role_policy" "task_policy" {
      + id     = (known after apply)
      + name   = "community-challenge-task_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs-policy-att will be created
  + resource "aws_iam_role_policy_attachment" "ecs-policy-att" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "community-challenge-ecs-role"
    }

  # aws_lb.ecs-lb will be created
  + resource "aws_lb" "ecs-lb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "community-challenge-lb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Environment" = "production"
          + "Project"     = "community-challenge"
        }
      + tags_all                                    = {
          + "Environment" = "production"
          + "Project"     = "community-challenge"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.ec-lb-listener will be created
  + resource "aws_lb_listener" "ec-lb-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Project" = "community-challenge"
        }
      + tags_all          = {
          + "Project" = "community-challenge"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.test will be created
  + resource "aws_lb_target_group" "test" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = "ipv4"
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "community-challenge-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "production"
          + "Project"     = "community-challenge"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Project"     = "community-challenge"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)
    }

  # aws_secretsmanager_secret.api_email will be created
  + resource "aws_secretsmanager_secret" "api_email" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "CF_API_EMAIL-test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.api_key will be created
  + resource "aws_secretsmanager_secret" "api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "CF_API_KEY-test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.zone will be created
  + resource "aws_secretsmanager_secret" "zone" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "ZONE_ID-test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_security_group.ecs-sg will be created
  + resource "aws_security_group" "ecs-sg" {
      + arn                    = (known after apply)
      + description            = "Allow http traffic from load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow public access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "frontend-container"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb-sg will be created
  + resource "aws_security_group" "lb-sg" {
      + arn                    = (known after apply)
      + description            = "Allow http traffic from public"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow public access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "load-balancer-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.backend-image.aws_ecr_repository.foo will be created
  + resource "aws_ecr_repository" "foo" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "community-challenge-backend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.frontend-image.aws_ecr_repository.foo will be created
  + resource "aws_ecr_repository" "foo" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "community-challenge-frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all               = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all               = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all               = {
          + "Name"         = "community-challenge-VPC-default"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all             = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                           = {
          + "Name"         = "community-challenge-VPC-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"         = "community-challenge-VPC-private"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all         = {
          + "Name"         = "community-challenge-VPC-private"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"         = "community-challenge-VPC-public"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all         = {
          + "Name"         = "community-challenge-VPC-public"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-private-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-private-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-private-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-private-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-public-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-public-us-west-2a"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "community-challenge-VPC-public-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                                       = {
          + "Name"         = "community-challenge-VPC-public-us-west-2b"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
      + tags_all                             = {
          + "Name"         = "community-challenge-VPC"
          + "Terraform"    = "true"
          + "project_name" = "community-challenge"
        }
    }

Plan: 37 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @realexcel2021, Action: `pull_request`*